# EJERCICIOS DE CARGA

## Ejercicio 1: Datos de BD

In [1]:
pip install sqlalchemy pymysql

Requirement already satisfied: sqlalchemy in c:\users\jafas\anaconda3\lib\site-packages (2.0.25)
Collecting pymysql
  Using cached PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\jafas\anaconda3\lib\site-packages (from sqlalchemy) (4.9.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\jafas\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)
Using cached PyMySQL-1.1.1-py3-none-any.whl (44 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1
Note: you may need to restart the kernel to use updated packages.

In [2]:
from sqlalchemy import create_engine
import pandas as pd

engine = create_engine(f"mysql+pymysql://root:1234@localhost:3310/smartphones")

In [4]:
df_data = pd.read_sql("SELECT * FROM table_name", engine)
df_data.head()

,brand_name,model,price,rating,has_5g,has_nfc,has_ir_blaster,processor_brand,num_cores,processor_speed,...,refresh_rate,num_rear_cameras,num_front_cameras,os,primary_camera_rear,primary_camera_front,extended_memory_available,extended_upto,resolution_width,resolution_height
0,oneplus,OnePlus 11 5G,54999,89.0,TRUE,TRUE,FALSE,snapdragon,8.0,3.2,...,120,3,1.0,android,50.0,16.0,0,NaN,1440,3216
1,oneplus,OnePlus Nord CE 2 Lite 5G,19989,81.0,TRUE,FALSE,FALSE,snapdragon,8.0,2.2,...,120,3,1.0,android,64.0,16.0,1,1024.0,1080,2412
2,samsung,Samsung Galaxy A14 5G,16499,75.0,TRUE,FALSE,FALSE,exynos,8.0,2.4,...,90,3,1.0,android,50.0,13.0,1,1024.0,1080,2408
3,motorola,Motorola Moto G62 5G,14999,81.0,TRUE,FALSE,FALSE,snapdragon,8.0,2.2,...,120,3,1.0,android,50.0,16.0,1,1024.0,1080,2400
4,realme,Realme 10 Pro Plus,24999,82.0,TRUE,FALSE,FALSE,dimensity,8.0,2.6,...,120,3,1.0,android,108.0,16.0,0,NaN,1080,2412

In [5]:
df_data.size

25480

In [6]:
print(len(df_data))

980

In [7]:
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 980 entries, 0 to 979
Data columns (total 26 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   brand_name                 980 non-null    object
 1   model                      980 non-null    object
 2   price                      980 non-null    int64
 3   rating                     879 non-null    float64
 4   has_5g                     980 non-null    object
 5   has_nfc                    980 non-null    object
 6   has_ir_blaster             980 non-null    object
 7   processor_brand            960 non-null    object
 8   num_cores                  974 non-null    float64
 9   processor_speed            938 non-null    float64
 10  battery_capacity           969 non-null    float64
 11  fast_charging_available    980 non-null    int64
 12  fast_charging              769 non-null    float64
 13  ram_capacity               980 non-null    int64
 14  internal_memory            980 non-null    int64
 15  screen_size                980 non-null    float64
 16  refresh_rate               980 non-null    int64
 17  num_rear_cameras           980 non-null    int64
 18  num_front_cameras          976 non-null    float64
 19  os                         966 non-null    object
 20  primary_camera_rear        980 non-null    float64
 21  primary_camera_front       975 non-null    float64
 22  extended_memory_available  980 non-null    int64
 23  extended_upto              500 non-null    float64
 24  resolution_width           980 non-null    int64
 25  resolution_height          980 non-null    int64
dtypes: float64(10), int64(9), object(7)
memory usage: 199.2+ KB

## Limpiar datos

In [11]:
df_data = df_data.dropna(subset=['rating'])

In [12]:
print(len(df_data))

879

## TransformaciÃ³n de Datos

In [13]:
df_data = df_data[['brand_name', 'model', 'price', 'rating']]

In [14]:
print(len(df_data))
df_data

879

    brand_name                            model  price  rating
0      oneplus                    OnePlus 11 5G  54999    89.0
1      oneplus        OnePlus Nord CE 2 Lite 5G  19989    81.0
2      samsung            Samsung Galaxy A14 5G  16499    75.0
3     motorola             Motorola Moto G62 5G  14999    81.0
4       realme               Realme 10 Pro Plus  24999    82.0
..         ...                              ...    ...     ...
975   motorola       Motorola Moto Edge S30 Pro  34990    83.0
976      honor                      Honor X8 5G  14990    75.0
977       poco  POCO X4 GT 5G (8GB RAM + 256GB)  28990    85.0
978   motorola             Motorola Moto G91 5G  19990    80.0
979    samsung           Samsung Galaxy M52s 5G  24990    74.0

[879 rows x 4 columns]

## Exportar datos a una tabla temporal de SQL

In [15]:
from sqlalchemy import text

with engine.connect() as conn:
    conn.execute(text("""
        CREATE TEMPORARY TABLE ratings_table (
            `brand_name` text,
            `model` text,
            `price` text,
            `rating` text
        );
    """))

In [16]:
df_data.to_sql(
    name='ratings_table',
    con=engine,
    if_exists='append',
    index=False
)

879

In [17]:
verification_query = f"SELECT * FROM ratings_table LIMIT 15"
result = pd.read_sql(verification_query, engine)
print(result)

   brand_name                                    model  price rating
0     oneplus                            OnePlus 11 5G  54999     89
1     oneplus                OnePlus Nord CE 2 Lite 5G  19989     81
2     samsung                    Samsung Galaxy A14 5G  16499     75
3    motorola                     Motorola Moto G62 5G  14999     81
4      realme                       Realme 10 Pro Plus  24999     82
5     samsung  Samsung Galaxy F23 5G (6GB RAM + 128GB)  16999     80
6       apple                          Apple iPhone 14  65999     81
7      xiaomi            Xiaomi Redmi Note 12 Pro Plus  29999     86
8     nothing                          Nothing Phone 1  26749     85
9     oneplus                       OnePlus Nord 2T 5G  28999     84
10     realme                            Realme 10 Pro  18999     82
11       oppo                                 Oppo A78  18999     79
12     xiaomi              Xiaomi Redmi Note 12 Pro 5G  24762     79
13       vivo             Vivo T1 5G (6GB RAM + 128GB)  16990     80
14      apple                          Apple iPhone 13  62999     79

## Ejercicio 2: Datos de una API

In [18]:
import requests
import pandas as pd

url = "https://rickandmortyapi.com/api/character"
all_characters = []

while url:
    response = requests.get(url)
    data = response.json()
    
    for personaje in data["results"]:
        all_characters.append({
            "name": personaje["name"],
            "status": personaje["status"],
            "species": personaje["species"]
        })
    
    url = data["info"]["next"]
df = pd.DataFrame(all_characters)

In [19]:
df

             name   status species
0    Rick Sanchez    Alive   Human
1     Morty Smith    Alive   Human
2    Summer Smith    Alive   Human
3      Beth Smith    Alive   Human
4     Jerry Smith    Alive   Human
..            ...      ...     ...
821   Young Jerry  unknown   Human
822    Young Beth  unknown   Human
823    Young Beth  unknown   Human
824   Young Jerry  unknown   Human
825  Butter Robot    Alive   Robot

[826 rows x 3 columns]

In [20]:
df.dropna()

             name   status species
0    Rick Sanchez    Alive   Human
1     Morty Smith    Alive   Human
2    Summer Smith    Alive   Human
3      Beth Smith    Alive   Human
4     Jerry Smith    Alive   Human
..            ...      ...     ...
821   Young Jerry  unknown   Human
822    Young Beth  unknown   Human
823    Young Beth  unknown   Human
824   Young Jerry  unknown   Human
825  Butter Robot    Alive   Robot

[826 rows x 3 columns]

In [21]:
df = df[['name', 'species']]

In [22]:
df

             name species
0    Rick Sanchez   Human
1     Morty Smith   Human
2    Summer Smith   Human
3      Beth Smith   Human
4     Jerry Smith   Human
..            ...     ...
821   Young Jerry   Human
822    Young Beth   Human
823    Young Beth   Human
824   Young Jerry   Human
825  Butter Robot   Robot

[826 rows x 2 columns]

In [23]:
from sqlalchemy import text

with engine.connect() as conn:
    conn.execute(text("""
        CREATE TEMPORARY TABLE characters_rick (
            name VARCHAR(100),
            species VARCHAR(50)
        );
    """))

In [24]:
df.to_sql(
    name='characters_rick',
    con=engine,
    if_exists='append', 
    index=False
)

826

In [25]:
verification_query = f"SELECT * FROM characters_rick LIMIT 20"
result = pd.read_sql(verification_query, engine)
print(result)

                         name species
0                Rick Sanchez   Human
1                 Morty Smith   Human
2                Summer Smith   Human
3                  Beth Smith   Human
4                 Jerry Smith   Human
5   Abadango Cluster Princess   Alien
6            Abradolf Lincler   Human
7            Adjudicator Rick   Human
8             Agency Director   Human
9                  Alan Rails   Human
10            Albert Einstein   Human
11                  Alexander   Human
12               Alien Googah   Alien
13                Alien Morty   Alien
14                 Alien Rick   Alien
15               Amish Cyborg   Alien
16                      Annie   Human
17              Antenna Morty   Human
18               Antenna Rick   Human
19    Ants in my Eyes Johnson   Human